/*========================================================================
                               let和const

1、块作用域：一个{}，则为一个块作用域
2、ES6启用严格模式：变量未声明，不能引用，否则报引用错误，而不是undefined
3、不能重复声明let变量
4、const在声明时必须赋值，且声明的变量不能再进行修改。
5、const在声明对象时，只要其指向的指针不变，则不会出错，详见last()函数
==========================================================================*/

function test(){

	for(let i=1;i<3;i++){
		console.log(i)
	}
	console.log(i) //此时会报错，在for循环退出后的i没有被定义

	let a = 1;
	let a = 2; //此时会报错，不能重复声明let变量

}

function last(){
	const PI = 3.1415926;
	PI = 8;
	console.log(PI); //此时会报错PI is read-only，const声明的变量不能再进行修改

	const k = {
		a:1
	}
	k.b = 3;
	console.log(k)//此时不会报错，因为k指向a对象的指针始终没变，即使a对象的值从1变为2，对k来说也毫无影响
}
